** EXWM
#+BEGIN_SRC elisp
(require 'exwm)
(require 'exwm-config)
(exwm-config-default)
(require 'exwm-randr)
;;(setq exwm-randr-workspace-monitor-plist (0 "eDP1"))
(add-hook 'exwm-randr-screen-change-hook
          (lambda ()
            (start-process-shell-command
             "xrandr" nil "xrandr --output eDP1 --mode 1920x1080 --pos 0x0 --rotate normal")))
 (exwm-randr-enable)
(setq exwm-input-global-keys
      `(
        ([?\s-r] . exwm-reset)
        ([?\s-h] . windmove-left)
        ([?\s-l] . windmove-right)
        ([?\s-k] . windmove-up)
        ([?\s-j] . windmove-down)
        ([?\s-o] . counsel-linux-app)
        ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))
        ([?\s-w] . exwm-workspace-switch)
        ,@(mapcar (lambda (i)
                      `(,(kbd (format "s-%d" i)) .
                        (lambda ()
                          (interactive)
                          (exwm-workspace-switch-create ,i))))
                    (number-sequence 0 9))))

(defun efs/set-wallpaper ()
  (interactive)
  (start-process-shell-command
      "wal" nil  "wal -i ~/org/assets/pix/Background/pywal/hood-radio.jpg"))

(defun efs/exwm-init-hook ()
  (exwm-workspace-switch-create 1))

  (display-battery-mode 1)
  (setq display-time-day-and-date t)
  (display-time-mode 1)

  (defun efs/run-in-background (command)
  (let ((command-parts (split-string command "[ ]+")))
    (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

  (defun efs/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

  (add-hook 'exwm-update-class-hook #'efs/exwm-update-class)
  (add-hook 'exwm-init-hook #'efs/exwm-init-hook)
  (efs/set-wallpaper)
  (require 'exwm-systemtray)
  (setq exwm-systemtray-height 32)
  (exwm-systemtray-enable)
;; (require 'exwm-systemtray)
;; (exwm-systemtray-enable)

#+END_SRC

#+RESULTS:
: (([8388722] . exwm-reset) ([8388712] . windmove-left) ([8388716] . windmove-right) ([8388715] . windmove-up) ([8388714] . windmove-down) ([8388719] . counsel-linux-app) ([8388704] lambda nil (interactive) (exwm-workspace-switch-create 0)) 0 1 2 3 4 5 6 7 8 9)

